backend/tests/load/sign-in/signin-100.yml
config:
  target: "http://localhost:4000"
  phases:
    # 100 sign-ins trong 10 giây
    - duration: 10
      arrivalRate: 10
      name: "100 sign-ins in 10 seconds"
  processor: "./processor.js"
  variables:
    email: ""
    password: ""

scenarios:
  - name: "Sign-in load test - 100 requests"
    flow:
      # Random chọn user
      - function: "setRandomUser"
      
      # Sign-in request
      - post:
          url: "/api/auth/signin"
          headers:
            Content-Type: "application/json"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.ok"
              as: "success"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: token
            - hasProperty: ok